icc/15_excepciones.org
#+TITLE: Errores y Excepciones

Seguramente te habrá salido más de una vez errores en tiempo de
ejecución, como por ejemplo cuando tratamos de leer un argumento /que
no se ha pasado/ como por ejemplo el siguiente código

#+begin_src java
  public class Lol {
      public static void main (String[] args){
  	String s = args[0];
  	System.out.println(s);
      }
  }
#+end_src

Y ejecutarlo /sin argumentos/ como

#+begin_src bash
$ java Lol
#+end_src

Nos mostrará un mensaje de error como el siguiente

#+begin_example
Exception in thread "main" java.lang.ArrayIndexOutOfBoundsException: Index 0 out of bounds for length 0
        at Lol.main(Lol.java:4)
#+end_example
Ya que *no estamos supliendo el argumento* pero sí estamos tratando de
acceder a él, además que nos dice en qué línea exactamente ocurrió el
error. ~Lol.java:4~ y lo que ocurrió ~Index 0 out of bounds for length
0~. 

Otro ejemplo por ejemplo es convertir una cadena a un entero. 

#+begin_src java
  public class Lol {
    public static void main (String[] args){
	int i = Integer.parseInt(args[0]);
    }
}
#+end_src

Pero si intentamos ejecutarlo como

#+begin_src bash
  $ java Lol "Hola crayola"
#+end_src

Fallará porque *no se puede convertir H a un número*, son tipos de
información diferentes, aunque el programa /este correctamente
escrito/.

Estos errores en /tiempo de ejecución/ son conocidos como
*Excepciones* /Exception/ en inglés. Hay infinidad de excepciones
/clasificadas/ en java pero particularmente existen los /Errores/ de
los cuales es muy dificil recuperar el programa y las /Excepciones/
que sí podemos hacer algo para darle la vuelta al problema. Todos son
/objetos/ también ya que extienden de la clase /Object/, con la
característica que son creadas en tiempo de ejecución.

* Estructura Try-catch
Podemos /probar un código/ que potencialmente falle si lo encerramos
dentro de una estructura /try-catch/ como sigue.

#+begin_src java
  public class Lol {
      public static void main (String[] args){
  	try {
  	    // Código a intentar
  	    String s = args[0];
  	    System.out.println(s);
  	} catch (Exception e) {
  	    // Código que se ejecuta si falla el intento
  	    System.out.println("Pasame un argumento LOL");
  	    // e.printStackTrace(); es el mensaje que salía
  	}
      }
  }
#+end_src

Es claro que si nuestro programa *no recibe argumentos*, mostrará el
mensaje de /Pasame un argumento LOL/, en lugar de mostrarnos el texto

#+begin_example
Exception in thread "main" java.lang.ArrayIndexOutOfBoundsException: Index 0 out of bounds for length 0
        at Lol.main(Lol.java:4)
#+end_example

Es una forma /más limpia/ y /más robusta/ de tapar errores en tiempo
de ejecución ya que estamos conscientes que /puede pasar ese caso/ y
lo estamos /parchando/.

Más a profundidad, lo que sucede es que cada vez que /falla una
instrucción/, /Java/ crea un objeto del tipo de error que sucedió. En
este caso es de tipo ~ArrayIndexOutOfBoundException~.  que es
*lanzado* hacia el método anterior, interrumpiendo el algoritmo
/dentro del try-catch/. Este /objeto/ es *cachado* por el ~catch~, y
continuará con el subcódigo que contiene éste. Para que sea *cachado*
tanto el tipo de la excepción como el argumento de /catch/ deben
coincidir al menos en herencia. Usamos /Exception/ porque es la clase
padre de /todas/ las excepciones, pero un mejor código sería hacer el
try catch como.

#+begin_src java
  public class Lol {
      public static void main (String[] args){
  	try {
  	    // Código a intentar
  	    String s = args[0];
  	    System.out.println(s);
  	} catch (ArrayIndexOutOfBoundsException aioofe) {
  	    // Código que se ejecuta si falla el intento
  	    System.out.println("Pasame un argumento LOL");
  	    // e.printStackTrace(); es el mensaje que salía
  	}
      }
  }
#+end_src
Ya que estamos particularmente diciendo qué tipo de error es, en lugar
de generalizar a /cualquier error/.


