icc/15_excepciones.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-24 dom 16:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Errores y Excepciones</title>
<meta name="author" content="Davidshiro Pichu" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Errores y Excepciones</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org07ae8d4">1. Estructura Try-catch</a></li>
<li><a href="#org638d850">2. throws</a></li>
<li><a href="#org438fabd">3. Excepciones comunes</a>
<ul>
<li><a href="#orgd07796b">3.1. ArrayIndexOutOfBoundsException</a></li>
<li><a href="#org10e28a6">3.2. NumberFormatException</a></li>
<li><a href="#orgf5123b1">3.3. StackOverFlowError</a></li>
<li><a href="#org91e2af1">3.4. OutOfMemoryException</a></li>
<li><a href="#org9e3bfaf">3.5. ArithmeticException</a></li>
<li><a href="#orge93bbf8">3.6. ClassCastException</a></li>
<li><a href="#orgd70e39c">3.7. NullPointerException</a></li>
<li><a href="#orgd6467e7">3.8. FileNotFoundException</a></li>
<li><a href="#orgf99c6ae">3.9. IllegalArgumentException</a></li>
<li><a href="#org37c8a2e">3.10. AssertionError</a></li>
</ul>
</li>
<li><a href="#org9186979">4. Ejercicios</a></li>
</ul>
</div>
</div>
<p>
Seguramente te habrá salido más de una vez errores en tiempo de
ejecución, como por ejemplo cuando tratamos de leer un argumento <i>que
no se ha pasado</i> como por ejemplo el siguiente código
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">class</span> <span style="color: #2F8B58; font-weight: bold;">Lol</span> {
    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">main</span> (<span style="color: #2F8B58; font-weight: bold;">String</span>[] <span style="color: #0084C8; font-weight: bold;">args</span>){
        <span style="color: #2F8B58; font-weight: bold;">String</span> <span style="color: #0084C8; font-weight: bold;">s</span> = args[0];
        System.out.println(s);
    }
}
</pre>
</div>

<p>
Y ejecutarlo <i>sin argumentos</i> como
</p>

<div class="org-src-container">
<pre class="src src-bash">$ java Lol
</pre>
</div>

<p>
Nos mostrará un mensaje de error como el siguiente
</p>

<pre class="example" id="orgea4b08c">
Exception in thread "main" java.lang.ArrayIndexOutOfBoundsException: Index 0 out of bounds for length 0
        at Lol.main(Lol.java:4)
</pre>
<p>
Ya que <b>no estamos supliendo el argumento</b> pero sí estamos tratando de
acceder a él, además que nos dice en qué línea exactamente ocurrió el
error. <code>Lol.java:4</code> y lo que ocurrió <code>Index 0 out of bounds for length
0</code>. 
</p>

<p>
Otro ejemplo por ejemplo es convertir una cadena a un entero. 
</p>

<div class="org-src-container">
<pre class="src src-java">  <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">class</span> <span style="color: #2F8B58; font-weight: bold;">Lol</span> {
    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">main</span> (<span style="color: #2F8B58; font-weight: bold;">String</span>[] <span style="color: #0084C8; font-weight: bold;">args</span>){
        <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">i</span> = Integer.parseInt(args[0]);
    }
}
</pre>
</div>

<p>
Pero si intentamos ejecutarlo como
</p>

<div class="org-src-container">
<pre class="src src-bash">$ java Lol <span style="color: #4E9A06;">"Hola crayola"</span>
</pre>
</div>

<p>
Fallará porque <b>no se puede convertir H a un número</b>, son tipos de
información diferentes, aunque el programa <i>este correctamente
escrito</i>.
</p>

<p>
Estos errores en <i>tiempo de ejecución</i> son conocidos como
<b>Excepciones</b> <i>Exception</i> en inglés. Hay infinidad de excepciones
<i>clasificadas</i> en java pero particularmente existen los <i>Errores</i> de
los cuales es muy dificil recuperar el programa y las <i>Excepciones</i>
que sí podemos hacer algo para darle la vuelta al problema. Todos son
<i>objetos</i> también ya que extienden de la clase <i>Object</i>, con la
característica que son creadas en tiempo de ejecución.
</p>
<div id="outline-container-org07ae8d4" class="outline-2">
<h2 id="org07ae8d4"><span class="section-number-2">1.</span> Estructura Try-catch</h2>
<div class="outline-text-2" id="text-1">
<p>
Podemos <i>probar un código</i> que potencialmente falle si lo encerramos
dentro de una estructura <i>try-catch</i> como sigue.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">class</span> <span style="color: #2F8B58; font-weight: bold;">Lol</span> {
    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">main</span> (<span style="color: #2F8B58; font-weight: bold;">String</span>[] <span style="color: #0084C8; font-weight: bold;">args</span>){
        <span style="color: #A52A2A; font-weight: bold;">try</span> {
            <span style="color: #204A87;">// </span><span style="color: #204A87;">C&#243;digo a intentar
</span>            <span style="color: #2F8B58; font-weight: bold;">String</span> <span style="color: #0084C8; font-weight: bold;">s</span> = args[0];
            System.out.println(s);
        } <span style="color: #A52A2A; font-weight: bold;">catch</span> (<span style="color: #2F8B58; font-weight: bold;">Exception</span> <span style="color: #0084C8; font-weight: bold;">e</span>) {
            <span style="color: #204A87;">// </span><span style="color: #204A87;">C&#243;digo que se ejecuta si falla el intento
</span>            System.out.println(<span style="color: #4E9A06;">"Pasame un argumento LOL"</span>);
            <span style="color: #204A87;">// </span><span style="color: #204A87;">e.printStackTrace(); es el mensaje que sal&#237;a
</span>        }
    }
}
</pre>
</div>

<p>
Es claro que si nuestro programa <b>no recibe argumentos</b>, mostrará el
mensaje de <i>Pasame un argumento LOL</i>, en lugar de mostrarnos el texto
</p>

<pre class="example" id="org5eccc42">
Exception in thread "main" java.lang.ArrayIndexOutOfBoundsException: Index 0 out of bounds for length 0
        at Lol.main(Lol.java:4)
</pre>

<p>
Es una forma <i>más limpia</i> y <i>más robusta</i> de tapar errores en tiempo
de ejecución ya que estamos conscientes que <i>puede pasar ese caso</i> y
lo estamos <i>parchando</i>.
</p>

<p>
Más a profundidad, lo que sucede es que cada vez que <i>falla una
instrucción</i>, <i>Java</i> crea un objeto del tipo de error que sucedió. En
este caso es de tipo <code>ArrayIndexOutOfBoundException</code>.  que es
<b>lanzado</b> hacia el método anterior, interrumpiendo el algoritmo
<i>dentro del try-catch</i>. Este <i>objeto</i> es <b>cachado</b> por el <code>catch</code>, y
continuará con el subcódigo que contiene éste. Para que sea <b>cachado</b>
tanto el tipo de la excepción como el argumento de <i>catch</i> deben
coincidir al menos en herencia. Usamos <i>Exception</i> porque es la clase
padre de <i>todas</i> las excepciones, pero un mejor código sería hacer el
try catch como.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">class</span> <span style="color: #2F8B58; font-weight: bold;">Lol</span> {
    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">main</span> (<span style="color: #2F8B58; font-weight: bold;">String</span>[] <span style="color: #0084C8; font-weight: bold;">args</span>){
        <span style="color: #A52A2A; font-weight: bold;">try</span> {
            <span style="color: #204A87;">// </span><span style="color: #204A87;">C&#243;digo a intentar
</span>            <span style="color: #2F8B58; font-weight: bold;">String</span> <span style="color: #0084C8; font-weight: bold;">s</span> = args[0];
            System.out.println(s);
        } <span style="color: #A52A2A; font-weight: bold;">catch</span> (<span style="color: #2F8B58; font-weight: bold;">ArrayIndexOutOfBoundsException</span> <span style="color: #0084C8; font-weight: bold;">aioofe</span>) {
            <span style="color: #204A87;">// </span><span style="color: #204A87;">C&#243;digo que se ejecuta si falla el intento
</span>            System.out.println(<span style="color: #4E9A06;">"Pasame un argumento LOL"</span>);
            <span style="color: #204A87;">// </span><span style="color: #204A87;">e.printStackTrace(); es el mensaje que sal&#237;a
</span>        }
    }
}
</pre>
</div>
<p>
Ya que estamos particularmente diciendo qué tipo de error es, en lugar
de generalizar a <i>cualquier error</i>.
</p>
</div>
</div>
