icc/15_excepciones.org
* throws
Podemos crear métodos que al momento de fallar (una falla
personalizada) lancen ciertos tipos de errores, errores
personalizados. Crearemos un método que solo reciba números
positivos, y en caso de que no sea positivo lanzar una excepción.

#+begin_src java
  public class Lol {
      public static void main (String[] args){
  	int n = soloPositivo(args[0]);
  	System.out.println(n);	
      }
        
      /* Solo regresa números positivos */  
      public static int soloPositivo(String s) throws IllegalArgumentException {
  	int i;
  	try {
  	    i = Integer.parseInt(s);
  	} catch (NumberFormatException nfe){
  	    throw new IllegalArgumentException("No es cadena");
  	}
  	// Error personalizado
  	if (i < 0)
  	    throw new IllegalArgumentException("El número es negativo");
  	return i;
      }
  }
#+end_src

La palabra clave /throws/ significa que si falla este método *lanzará*
una excepción del tipo que se especifica adelante, en este caso
~IllegalArgumentException~ y que no puede ser /cachada/ por este método,
sino que deberá ser cachada por algún /try-catch/ que encierre este código.

Podemos ver que intentamos convertir la cadena /s/ a un entero. El
método ~Integer.parseInt(String s)~ está definido en el [[https://github.com/openjdk/jdk/blob/master/src/java.base/share/classes/java/lang/Integer.java#L661][código de Java]]
~Integer.java~ /exactamente/ como.

#+begin_src java
    public static int parseInt(String s) throws NumberFormatException {
        return parseInt(s, 10);
    }
#+end_src

Que al igual que nuestro método ~soloPositivo()~, si falla el método
~parseInt(s, 10)~ lanzará una excepción del tipo
~NumberFormatException~, el cual *cachamos* con nuestro ~catch
(NumberFormatException nfe)~ y al cacharlo ejecuta el código del
catch, que a su vez /lanza una nueva excepción/ ahora del tipo
~IllegalArgumentException~ que no manejaremos en este método, *sino en
el método main*, el método de /"arriba"/

De igual forma, el ~if~ nos permite filtrar los números por todos los
que sean menores a 0, y si cumple entonces /lanzamos/ excepción, como
si fuera /un error si el número es negativo/.  Finalmente si el número
es positivo, lo regresamos.

Adicionalmente podemos personalizar el /mensaje de error/ pasando como
argumento al constructor del objeto ~IllegalArgumentException~ el
error como /String/; en general se puede para cualquier Excepción.

* Excepciones comunes
A continuación algunas excepciones que son del día a día al tratar de
hacer casos imposibles. Algunas se necesitan importar al programa con
~import~.

** ArrayIndexOutOfBoundsException
Cuando queremos acceder a una posición /fuera/ de un arreglo, ya sea
antes o después.

#+begin_src java
  int [] arr = new int[10];
  // arr[-1] no existe
  System.out.println(arr[-1]);
  // la posición arr[10] no existe, porque empieza en
  // indice 0, hasta 9, haciendo 10 lugares en total
  System.out.println(arr[10]);
#+end_src

** NumberFormatException
Cuando no podemos crear correctamente un número a partir de una
cadena.
#+begin_src java
  // aaa no es un número
  int i = Integer.parseInt("aaaa");
#+end_src

** StackOverFlowError
Cuando hemos hecho /demasiadas/ llamadas recursivas y la pila de
ejecución se llena de tantos métodos apilados que no puede hacer más
llamadas.

#+begin_src java
  public static void main (String[] args){
      foo(20);
  }

  public void foo(int n){
      return foo(n-1);
  }
#+end_src

** OutOfMemoryException
Cuando usamos más memoria de la que podemos usar en la JVM. Después de
 ejecutar este código un rato obtendrás el error. Estamos agregando
 /infinitamente/ números a una /Lista/ y eventualmente no habrá
 espacio para contener al infinito.

#+begin_src java
  import java.util.ArrayList;

  public class Lol {
      public static void main (String[] args){
  	ArrayList<Integer> l = new ArrayList<>();
  	while (true)
  	    l.add((int)(Math.random() * 10));
      }
  }
#+end_src

** ArithmeticException
Cuando dividimos por cero

#+begin_src java
  System.out.println(10/0);
#+end_src



