icc/15_excepciones.html
<div id="outline-container-org638d850" class="outline-2">
<h2 id="org638d850"><span class="section-number-2">2.</span> throws</h2>
<div class="outline-text-2" id="text-2">
<p>
Podemos crear métodos que al momento de fallar (una falla
personalizada) lancen ciertos tipos de errores, errores
personalizados. Crearemos un método que solo reciba números
positivos, y en caso de que no sea positivo lanzar una excepción.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">class</span> <span style="color: #2F8B58; font-weight: bold;">Lol</span> {
    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">main</span> (<span style="color: #2F8B58; font-weight: bold;">String</span>[] <span style="color: #0084C8; font-weight: bold;">args</span>){
        <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">n</span> = soloPositivo(args[0]);
        System.out.println(n);  
    }

    <span style="color: #204A87;">/* </span><span style="color: #204A87;">Solo regresa n&#250;meros positivos</span><span style="color: #204A87;"> */</span>  
    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">soloPositivo</span>(<span style="color: #2F8B58; font-weight: bold;">String</span> <span style="color: #0084C8; font-weight: bold;">s</span>) <span style="color: #A52A2A; font-weight: bold;">throws</span> <span style="color: #2F8B58; font-weight: bold;">IllegalArgumentException</span> {
        <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">i</span>;
        <span style="color: #A52A2A; font-weight: bold;">try</span> {
            i = Integer.parseInt(s);
        } <span style="color: #A52A2A; font-weight: bold;">catch</span> (<span style="color: #2F8B58; font-weight: bold;">NumberFormatException</span> <span style="color: #0084C8; font-weight: bold;">nfe</span>){
            <span style="color: #A52A2A; font-weight: bold;">throw</span> <span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">IllegalArgumentException</span>(<span style="color: #4E9A06;">"No es cadena"</span>);
        }
        <span style="color: #204A87;">// </span><span style="color: #204A87;">Error personalizado
</span>        <span style="color: #A52A2A; font-weight: bold;">if</span> (i &lt; 0)
            <span style="color: #A52A2A; font-weight: bold;">throw</span> <span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">IllegalArgumentException</span>(<span style="color: #4E9A06;">"El n&#250;mero es negativo"</span>);
        <span style="color: #A52A2A; font-weight: bold;">return</span> i;
    }
}
</pre>
</div>

<p>
La palabra clave <i>throws</i> significa que si falla este método <b>lanzará</b>
una excepción del tipo que se especifica adelante, en este caso
<code>IllegalArgumentException</code> y que no puede ser <i>cachada</i> por este método,
sino que deberá ser cachada por algún <i>try-catch</i> que encierre este código.
</p>

<p>
Podemos ver que intentamos convertir la cadena <i>s</i> a un entero. El
método <code>Integer.parseInt(String s)</code> está definido en el <a href="https://github.com/openjdk/jdk/blob/master/src/java.base/share/classes/java/lang/Integer.java#L661">código de Java</a>
<code>Integer.java</code> <i>exactamente</i> como.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">parseInt</span>(<span style="color: #2F8B58; font-weight: bold;">String</span> <span style="color: #0084C8; font-weight: bold;">s</span>) <span style="color: #A52A2A; font-weight: bold;">throws</span> <span style="color: #2F8B58; font-weight: bold;">NumberFormatException</span> {
    <span style="color: #A52A2A; font-weight: bold;">return</span> parseInt(s, 10);
}
</pre>
</div>

<p>
Que al igual que nuestro método <code>soloPositivo()</code>, si falla el método
<code>parseInt(s, 10)</code> lanzará una excepción del tipo
<code>NumberFormatException</code>, el cual <b>cachamos</b> con nuestro <code>catch
(NumberFormatException nfe)</code> y al cacharlo ejecuta el código del
catch, que a su vez <i>lanza una nueva excepción</i> ahora del tipo
<code>IllegalArgumentException</code> que no manejaremos en este método, <b>sino en
el método main</b>, el método de <i>"arriba"</i>
</p>

<p>
De igual forma, el <code>if</code> nos permite filtrar los números por todos los
que sean menores a 0, y si cumple entonces <i>lanzamos</i> excepción, como
si fuera <i>un error si el número es negativo</i>.  Finalmente si el número
es positivo, lo regresamos.
</p>

<p>
Adicionalmente podemos personalizar el <i>mensaje de error</i> pasando como
argumento al constructor del objeto <code>IllegalArgumentException</code> el
error como <i>String</i>; en general se puede para cualquier Excepción.
</p>
</div>
</div>
<div id="outline-container-org438fabd" class="outline-2">
<h2 id="org438fabd"><span class="section-number-2">3.</span> Excepciones comunes</h2>
<div class="outline-text-2" id="text-3">
<p>
A continuación algunas excepciones que son del día a día al tratar de
hacer casos imposibles. Algunas se necesitan importar al programa con
<code>import</code>.
</p>
</div>
<div id="outline-container-orgd07796b" class="outline-3">
<h3 id="orgd07796b"><span class="section-number-3">3.1.</span> ArrayIndexOutOfBoundsException</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Cuando queremos acceder a una posición <i>fuera</i> de un arreglo, ya sea
antes o después.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #2F8B58; font-weight: bold;">int</span> [] <span style="color: #0084C8; font-weight: bold;">arr</span> = <span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">int</span>[10];
<span style="color: #204A87;">// </span><span style="color: #204A87;">arr[-1] no existe
</span>System.out.println(arr[-1]);
<span style="color: #204A87;">// </span><span style="color: #204A87;">la posici&#243;n arr[10] no existe, porque empieza en
</span><span style="color: #204A87;">// </span><span style="color: #204A87;">indice 0, hasta 9, haciendo 10 lugares en total
</span>System.out.println(arr[10]);
</pre>
</div>
</div>
</div>
<div id="outline-container-org10e28a6" class="outline-3">
<h3 id="org10e28a6"><span class="section-number-3">3.2.</span> NumberFormatException</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Cuando no podemos crear correctamente un número a partir de una
cadena.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #204A87;">// </span><span style="color: #204A87;">aaa no es un n&#250;mero
</span><span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">i</span> = Integer.parseInt(<span style="color: #4E9A06;">"aaaa"</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf5123b1" class="outline-3">
<h3 id="orgf5123b1"><span class="section-number-3">3.3.</span> StackOverFlowError</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Cuando hemos hecho <i>demasiadas</i> llamadas recursivas y la pila de
ejecución se llena de tantos métodos apilados que no puede hacer más
llamadas.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">main</span> (<span style="color: #2F8B58; font-weight: bold;">String</span>[] <span style="color: #0084C8; font-weight: bold;">args</span>){
    foo(20);
}

<span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">foo</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">n</span>){
    <span style="color: #A52A2A; font-weight: bold;">return</span> foo(n-1);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org91e2af1" class="outline-3">
<h3 id="org91e2af1"><span class="section-number-3">3.4.</span> OutOfMemoryException</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Cuando usamos más memoria de la que podemos usar en la JVM. Después de
 ejecutar este código un rato obtendrás el error. Estamos agregando
 <i>infinitamente</i> números a una <i>Lista</i> y eventualmente no habrá
 espacio para contener al infinito.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">import</span> <span style="color: #F5666D;">java</span>.<span style="color: #F5666D;">util</span>.<span style="color: #2F8B58; font-weight: bold;">ArrayList</span>;

<span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">class</span> <span style="color: #2F8B58; font-weight: bold;">Lol</span> {
    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">main</span> (<span style="color: #2F8B58; font-weight: bold;">String</span>[] <span style="color: #0084C8; font-weight: bold;">args</span>){
        <span style="color: #2F8B58; font-weight: bold;">ArrayList</span>&lt;<span style="color: #2F8B58; font-weight: bold;">Integer</span>&gt; <span style="color: #0084C8; font-weight: bold;">l</span> = <span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">ArrayList</span>&lt;&gt;();
        <span style="color: #A52A2A; font-weight: bold;">while</span> (<span style="color: #F5666D;">true</span>)
            l.add((<span style="color: #2F8B58; font-weight: bold;">int</span>)(Math.random() * 10));
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org9e3bfaf" class="outline-3">
<h3 id="org9e3bfaf"><span class="section-number-3">3.5.</span> ArithmeticException</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Cuando dividimos por cero
</p>

<div class="org-src-container">
<pre class="src src-java">System.out.println(10/0);
</pre>
</div>
</div>
</div>
