icc/15_excepciones.org
** ClassCastException
Cuando /convertimos/ a través de polimorfismo (o casting) de un tipo a
otro que no se pueda.
#+begin_src java
  // Todo objeto es object
  Object o = new Integer(0);
  // Pero no todo object es string
  String s = (String)o;
#+end_src


** NullPointerException
Cuando accedemos con el operador ~.~ (punto) a un objeto que tiene
como valor la referencia /null/.

#+begin_src java
  public class Gato {
      // Objeto gato tiene un atributo nombre
      private String nombre;

      public static void main (String[] args){
  	// Se inicializa nombre con valor null por omisión
  	Gato g = new Gato();
  	// null.toUpperCase() = error
  	System.out.println(g.nombre.toUpperCase());
      }
  }   
#+end_src

** FileNotFoundException
No se pudo leer de cierta entrada, por ejemplo, no se puede leer de
una ruta que no se tienen los permisos de lectura o que no
existe. Particularmente si ocurre un error de salida/entrada se lanza
~IOException~, y ~FileNotFoundException~ es una subclase.

#+begin_src java
import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.io.FileInputStream;
import java.io.IOException;

public class Lol {
    public static void main(String[] args) throws IOException{
	BufferedReader br = new BufferedReader(new InputStreamReader(new FileInputStream("/root/lol.txt")));
    }
}
#+end_src


** IllegalArgumentException
No permitimos manejar /todos los valores/.

#+begin_src java
  public int dias(int años){
      if (años < 0)
  	throw new IllegalArgumentException("No hay años negativas");
      return 365*años;
  }
#+end_src

** AssertionError
Es utilizado normalmente para hacer /pruebas unitarias/. Expresa que
el resultado de un método no es el esperado, y al ser /Error/ es
irrecuperable el estado del programa. Como un
~IllegalArgumentException~ pero más estricto.

#+begin_src java
  public String mes(int numero){
      if (numero < 1 || numero > 12)
  	throw new AssertionError("No hay mes en " + numero);
      switch(numero){
      case 1: return "Enero";
  	...  	    
  }
#+end_src


* Ejercicios

Crea cada una de las excepciones descritas aquí y /cáchalas/ de manera
/eficiente/ con la estructura /try-catch/ para terminar _con gracia_
el programa.
