icc/15_excepciones.html
<div id="outline-container-orge93bbf8" class="outline-3">
<h3 id="orge93bbf8"><span class="section-number-3">3.6.</span> ClassCastException</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Cuando <i>convertimos</i> a través de polimorfismo (o casting) de un tipo a
otro que no se pueda.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #204A87;">// </span><span style="color: #204A87;">Todo objeto es object
</span><span style="color: #2F8B58; font-weight: bold;">Object</span> <span style="color: #0084C8; font-weight: bold;">o</span> = <span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">Integer</span>(0);
<span style="color: #204A87;">// </span><span style="color: #204A87;">Pero no todo object es string
</span><span style="color: #2F8B58; font-weight: bold;">String</span> <span style="color: #0084C8; font-weight: bold;">s</span> = (<span style="color: #2F8B58; font-weight: bold;">String</span>)o;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd70e39c" class="outline-3">
<h3 id="orgd70e39c"><span class="section-number-3">3.7.</span> NullPointerException</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Cuando accedemos con el operador <code>.</code> (punto) a un objeto que tiene
como valor la referencia <i>null</i>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">class</span> <span style="color: #2F8B58; font-weight: bold;">Gato</span> {
    <span style="color: #204A87;">// </span><span style="color: #204A87;">Objeto gato tiene un atributo nombre
</span>    <span style="color: #A52A2A; font-weight: bold;">private</span> <span style="color: #2F8B58; font-weight: bold;">String</span> <span style="color: #0084C8; font-weight: bold;">nombre</span>;

    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">main</span> (<span style="color: #2F8B58; font-weight: bold;">String</span>[] <span style="color: #0084C8; font-weight: bold;">args</span>){
        <span style="color: #204A87;">// </span><span style="color: #204A87;">Se inicializa nombre con valor null por omisi&#243;n
</span>        <span style="color: #2F8B58; font-weight: bold;">Gato</span> <span style="color: #0084C8; font-weight: bold;">g</span> = <span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">Gato</span>();
        <span style="color: #204A87;">// </span><span style="color: #204A87;">null.toUpperCase() = error
</span>        System.out.println(g.nombre.toUpperCase());
    }
}   
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd6467e7" class="outline-3">
<h3 id="orgd6467e7"><span class="section-number-3">3.8.</span> FileNotFoundException</h3>
<div class="outline-text-3" id="text-3-8">
<p>
No se pudo leer de cierta entrada, por ejemplo, no se puede leer de
una ruta que no se tienen los permisos de lectura o que no
existe. Particularmente si ocurre un error de salida/entrada se lanza
<code>IOException</code>, y <code>FileNotFoundException</code> es una subclase.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">import</span> <span style="color: #F5666D;">java</span>.<span style="color: #F5666D;">io</span>.<span style="color: #2F8B58; font-weight: bold;">BufferedReader</span>;
<span style="color: #A52A2A; font-weight: bold;">import</span> <span style="color: #F5666D;">java</span>.<span style="color: #F5666D;">io</span>.<span style="color: #2F8B58; font-weight: bold;">InputStreamReader</span>;
<span style="color: #A52A2A; font-weight: bold;">import</span> <span style="color: #F5666D;">java</span>.<span style="color: #F5666D;">io</span>.<span style="color: #2F8B58; font-weight: bold;">FileInputStream</span>;
<span style="color: #A52A2A; font-weight: bold;">import</span> <span style="color: #F5666D;">java</span>.<span style="color: #F5666D;">io</span>.<span style="color: #2F8B58; font-weight: bold;">IOException</span>;

<span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">class</span> <span style="color: #2F8B58; font-weight: bold;">Lol</span> {
    <span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #A52A2A; font-weight: bold;">static</span> <span style="color: #2F8B58; font-weight: bold;">void</span> <span style="color: #00578E; font-weight: bold;">main</span>(<span style="color: #2F8B58; font-weight: bold;">String</span>[] <span style="color: #0084C8; font-weight: bold;">args</span>) <span style="color: #A52A2A; font-weight: bold;">throws</span> <span style="color: #2F8B58; font-weight: bold;">IOException</span>{
        <span style="color: #2F8B58; font-weight: bold;">BufferedReader</span> <span style="color: #0084C8; font-weight: bold;">br</span> = <span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">BufferedReader</span>(<span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">InputStreamReader</span>(<span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">FileInputStream</span>(<span style="color: #4E9A06;">"/root/lol.txt"</span>)));
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf99c6ae" class="outline-3">
<h3 id="orgf99c6ae"><span class="section-number-3">3.9.</span> IllegalArgumentException</h3>
<div class="outline-text-3" id="text-3-9">
<p>
No permitimos manejar <i>todos los valores</i>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">dias</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">a&#241;os</span>){
    <span style="color: #A52A2A; font-weight: bold;">if</span> (a&#241;os &lt; 0)
        <span style="color: #A52A2A; font-weight: bold;">throw</span> <span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">IllegalArgumentException</span>(<span style="color: #4E9A06;">"No hay a&#241;os negativas"</span>);
    <span style="color: #A52A2A; font-weight: bold;">return</span> 365*a&#241;os;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org37c8a2e" class="outline-3">
<h3 id="org37c8a2e"><span class="section-number-3">3.10.</span> AssertionError</h3>
<div class="outline-text-3" id="text-3-10">
<p>
Es utilizado normalmente para hacer <i>pruebas unitarias</i>. Expresa que
el resultado de un método no es el esperado, y al ser <i>Error</i> es
irrecuperable el estado del programa. Como un
<code>IllegalArgumentException</code> pero más estricto.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #A52A2A; font-weight: bold;">public</span> <span style="color: #2F8B58; font-weight: bold;">String</span> <span style="color: #00578E; font-weight: bold;">mes</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">numero</span>){
    <span style="color: #A52A2A; font-weight: bold;">if</span> (numero &lt; 1 || numero &gt; 12)
        <span style="color: #A52A2A; font-weight: bold;">throw</span> <span style="color: #A52A2A; font-weight: bold;">new</span> <span style="color: #2F8B58; font-weight: bold;">AssertionError</span>(<span style="color: #4E9A06;">"No hay mes en "</span> + numero);
    <span style="color: #A52A2A; font-weight: bold;">switch</span>(numero){
    <span style="color: #A52A2A; font-weight: bold;">case</span> 1: <span style="color: #A52A2A; font-weight: bold;">return</span> <span style="color: #4E9A06;">"Enero"</span>;
        ...         
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9186979" class="outline-2">
<h2 id="org9186979"><span class="section-number-2">4.</span> Ejercicios</h2>
<div class="outline-text-2" id="text-4">
<p>
Crea cada una de las excepciones descritas aquí y <i>cáchalas</i> de manera
<i>eficiente</i> con la estructura <i>try-catch</i> para terminar <span class="underline">con gracia</span>
el programa.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davidshiro Pichu</p>
<p class="date">Created: 2025-08-24 dom 16:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
